{"pageProps":{"slug":"2020-11-22-tacx-flow-zwift","frontmatter":{"title":"Upgrading a Turbo Trainer to use with Zwift"},"date":"22nd November, 2020","title":"Upgrading a Turbo Trainer to use with Zwift","content":"<p>I was kindly gifted a bike turbo trainer from a neighbour during UK Lockdown #1,\nwhich was great fun whilst the weather was nice and exercise time was limited.</p>\n<p><img src=\"/images/blog/turbo-trainer-garden.jpg\" alt=\"B&#x27;Twin bike on a TacX turbo trainer\"></p>\n<p>It's a bit harder to cycle during the evenings now the days are shorter, so I was\nquite keen to give the virtual training app <a href=\"https://zwift.com/uk\">Zwift</a> a go.\nUnfortunately my trainer (TacX Flow Multiplayer T1901) doesn't support any\n\"smart\" capabilities, but it does output data to a head unit so I wondered\nwhether it was possible to grab this on my computer and relay to Zwift from there.</p>\n<p><img src=\"/images/blog/tacx-flow.jpeg\" alt=\"TacX Flow Turbo Trainer\"></p>\n<p>Fortunately I found a project on GitHub that has an <a href=\"https://github.com/totalreverse/ttyT1941/wiki\">extremely thorough breakdown\nof TacX hardware</a> and some code\nthat controls the motor brake. I stripped the end off an RJ12 cable, added some\nDuPont connectors and plugged it into a cheap <a href=\"https://www.aliexpress.com/item/1005001510943320.html?spm=a2g0o.productlist.0.0.55d566a0yMqaav&#x26;algo_pvid=269039b5-5cbd-4e5e-adf2-f222049e69b5&#x26;algo_expid=269039b5-5cbd-4e5e-adf2-f222049e69b5-0&#x26;btsid=2100bdd816061658116438940ef458&#x26;ws_ab_test=searchweb0_0,searchweb201602_,searchweb201603_\">CP2102 6 in 1 USB to serial converter</a>.</p>\n<p><img src=\"/images/blog/cp2102.jpeg\" alt=\"CP2102 serial converter\"></p>\n<p>I had to hunt the internet a bit to find out what to set the dip switches to.</p>\n<p><img src=\"/images/blog/cp2102-dip-switch.jpg\" alt=\"CP2102 dip switch chart\"></p>\n<p>No additional drivers needed on Ubuntu 20, plug it in and you can see the kernel\nmodule loaded.</p>\n<p><img src=\"/images/blog/cp2102-lsmod.png\" alt=\"lsmod showing cp210x driver loaded\"></p>\n<p>Everything was looking good, so I ran the python script included with ttyT1941\nand I got... nothing. Uncommenting some lines in the source for some additional\ndebugging information didn't yield any further information.</p>\n<p><img src=\"/images/blog/tty-fail.png\" alt=\"Terminal showing errors\"></p>\n<p>After that I tried a few different tools (minicom, interceptty, screen) to see\nif I could see any data at all coming directly from the device, but they all\nwere returning a blank. I re-tested the cable with a multimeter for connectivity,\nand checked that there was some current on Tx and Rx pins. Unfortunately that\nreaches the limit for what I'm able to test as I don't have access to an\noscilloscope.</p>\n<p>Off to eBay where I was able to buy a cheap T1904 green head unit, which should\nbe capable of controlling the motor brake. This head unit has a USB-B output.</p>\n<p>tbc...</p>\n"},"__N_SSG":true}